{
    "Mainline": {
      "Table": {
        "Header": {
          "Data": [
            "Parent Company",
            "Subsidiary Portfolio / Services",
            "HQ / Info",
            "Annual Revenue ($ million)",
            "HomePage",
            "Logo"
          ]
        },
        "Row": [
          {
            "Company": "UPS",
            "Services": "UPS Ground, UPS Freight",
            "Hubs": {
              "Hub": [
                "55 Glenlake Parkway, Sandy Springs, Georgia, U.S.",
                "UPS is a global leader in logistics, offering a broad range of solutions including the transportation of packages and freight; the facilitation of international trade, and the deployment of advanced technology to more efficiently manage the world of business."
              ]
            },
            "Revenue": "$24,752",
            "HomePage": "https://www.ups.com/",
            "Logo": "ups.jpg"
          },
          {
            "Company": "FedEx",
            "Services": "FedEx Ground, FedEx Freight, FedEx Custom Critical",
            "Hubs": {
              "Hub": [
                "942 South Shady Grove Road[1], Memphis, Tennessee, U.S.",
                "FedEx Corporation is an American multinational courier delivery services company headquartered in Memphis, Tennessee. The name FedEx is a syllabic abbreviation of the name of the company's original air division, Federal Express (now FedEx Express), which was used from 1973 until 2000. The company is known for its overnight shipping service, but also for pioneering a system that could track packages and provide real-time updates on package location."
              ]
            },
            "Revenue": "$14,149",
            "HomePage": "https://www.fedex.com",
            "Logo": "FedEx.jpg"
          },
          {
            "Company": "Con-way",
            "Services": "Less-than-Truckload (LTL) Freight, Truckload (TL) Services, Supply Chain and Logistics Management, International Freigh",
            "Hubs": {
              "Hub": [
                "Ann Arbor Charter Township, Michigan, U.S.",
                "Con-way, Inc. was an American multinational freight transportation and logistics company headquartered in Ann Arbor, Michigan, United States."
              ]
            },
            "Revenue": "$5,806 million",
            "HomePage": "https://ext-web.ltl-xpo.com/landing",
            "Logo": "con-way.png"
          },
          {
            "Company": "JBHunt",
            "Services": "Intermodal, Dedicated Contract Services (DCS), Truckload (JBT)",
            "Hubs": {
              "Hub": [
                "Lowell, Arkansas, U.S.",
                "J.B. Hunt operates an extensive network of terminals and service centers across the United States and Mexico, supporting its diverse service offerings."
              ]
            },
            "Revenue": "$3.30B",
            "HomePage": "https://www.jbhunt.com/",
            "Logo": "JBHunt.png"
          },
          {
            "Company": "Swift",
            "Services": "Dry Van Truckload, Refrigerated Truckload, Flatbed Truckload",
            "Hubs": {
              "Hub": [
                "Phoenix, Arizona, U.S.",
                "Swift is a vast network of terminals and service centers across the United States and Mexico, facilitating efficient freight movement."
              ]
            },
            "Revenue": "$6B",
            "HomePage": "https://careers.swifttrans.com/driver-jobs/experienced-CDL/?utm_campaign=IDPaidGoogleNonBrandDedicated5Lathrop&source=SwiftLead&number=866-982-1032&gad_source=1&gclid=EAIaIQobChMIgIrGl6aBjAMVDBatBh2fTDdQEAAYASAAEgKbdvD_BwE",
            "Logo": "swift.png"
          },
          {
            "Company": "YRCW",
            "Services": "Less-Than-Truckload (LTL) Shipping, Regional and Long-Haul Solutions,Cross-Border Shipping",
            "Hubs": {
              "Hub": [
                "5049 W Post Rd, Las Vegas, , U.S.",
                "YRC Freight operates an extensive network of terminals and service centers across the United States, Canada, and Mexico."
              ]
            },
            "Revenue": "$5.24B",
            "HomePage": "https://myyellow.com/",
            "Logo": "yrcw.png"
          }
        ]
      }
    }
  }